# 市场
MARKET_SZ = 0  # 深市
MARKET_SH = 1  # 沪市
MARKET_BJ = 2  # 北交

# K线种类
# 0 -   5 分钟K 线
KLINE_5MIN = 0
# 1 -   15 分钟K 线
KLINE_15MIN = 1
# 2 -   30 分钟K 线
KLINE_30MIN = 2
# 3 -   1 小时K 线
KLINE_1HOUR = 3
# 4 -   日K 线
KLINE_DAILY = 4
# 5 -   周K 线
KLINE_WEEKLY = 5
# 6 -   月K 线
KLINE_MONTHLY = 6
# 7 -   扩展市场 1 分钟
KLINE_EX_1MIN = 7
# 8 -   1 分钟K 线
KLINE_1MIN = 8
# 9 -   日K 线
KLINE_RI_K = 9
# 10 -  季K 线
KLINE_3MONTH = 10
# 11 -  年K 线
KLINE_YEARLY = 11

# 分笔行情最多2000条
MAX_TRANSACTION_COUNT = 2000

# K线数据最多800条
MAX_KLINE_COUNT = 800

# 板块相关参数
BLOCK_SZ = 'block_zs.dat'
BLOCK_FG = 'block_fg.dat'
BLOCK_GN = 'block_gn.dat'
BLOCK_DEFAULT = 'block.dat'

TYPE_FLATS = 0
TYPE_GROUP = 1

HQ_HOSTS = [
    ('通达深圳双线主站1', '110.41.147.114', 7709),
    ('通达深圳双线主站2', '110.41.2.72', 7709),
    ('通达深圳双线主站3', '110.41.4.4', 7709),
    ('通达深圳双线主站4', '175.178.112.197', 7709),
    ('通达深圳双线主站5', '175.178.128.227', 7709),
    ('通达深圳双线主站6', '110.41.154.219', 7709),
    ('通达上海双线主站1', '124.70.176.52', 7709),
    ('通达上海双线主站2', '122.51.120.217', 7709),
    ('通达上海双线主站3', '123.60.186.45', 7709),
    ('通达上海双线主站4', '123.60.164.122', 7709),
    ('通达上海双线主站5', '111.229.247.189', 7709),
    ('通达上海双线主站6', '124.70.199.56', 7709),
    ('通达北京双线主站1', '121.36.54.217', 7709),
    ('通达北京双线主站2', '121.36.81.195', 7709),
    ('通达北京双线主站3', '123.249.15.60', 7709),
    ('通达广州双线主站1', '124.71.85.110', 7709),
    ('通达广州双线主站2', '139.9.51.18', 7709),
    ('通达广州双线主站3', '139.159.239.163', 7709),
    ('通达上海双线主站7', '122.51.232.182', 7709),
    ('通达上海双线主站8', '118.25.98.114', 7709),
    ('通达上海双线主站9', '121.36.225.169', 7709),
    ('通达上海双线主站10', '123.60.70.228', 7709),
    ('通达上海双线主站11', '123.60.73.44', 7709),
    ('通达上海双线主站12', '124.70.133.119', 7709),
    ('通达上海双线主站13', '124.71.187.72', 7709),
    ('通达上海双线主站14', '124.71.187.122', 7709),
    ('通达武汉电信主站1', '119.97.185.59', 7709),
    ('通达深圳双线主站7', '129.204.230.128', 7709),
    ('通达北京双线主站4', '124.70.75.113', 7709),
    ('通达广州双线主站4', '124.71.9.153', 7709),
    ('通达上海双线主站15', '123.60.84.66', 7709),
    ('通达深圳双线主站8', '111.230.186.52', 7709),
    ('通达北京双线主站5', '120.46.186.223', 7709),
    ('通达北京双线主站6', '124.70.22.210', 7709),
    ('通达北京双线主站7', '139.9.133.247', 7709),
    ('通达广州双线主站5', '116.205.163.254', 7709),
    ('通达广州双线主站6', '116.205.171.132', 7709),
    ('通达广州双线主站7', '116.205.183.150', 7709),
]

EX_HOSTS = [
    ('扩展市场深圳双线1', '112.74.214.43', 7727),
    ('扩展市场深圳双线2', '120.25.218.6', 7727),
    ('扩展市场深圳双线3', '47.107.75.159', 7727),
    ('扩展市场深圳双线4', '47.106.204.218', 7727),
    ('扩展市场深圳双线5', '47.106.209.131', 7727),
    ('扩展市场武汉主站1', '139.9.191.175', 7727),
    ('扩展市场深圳双线6', '47.115.94.72', 7727),
    ('扩展市场上海双线1', '106.14.95.149', 7727),
    ('扩展市场上海双线2', '47.102.108.214', 7727),
    ('扩展市场上海双线3', '47.103.86.229', 7727),
    ('扩展市场上海双线4', '47.103.88.146', 7727),
    ('扩展市场广州双线1', '116.205.143.214', 7727),
    ('扩展市场广州双线2', '124.71.223.19', 7727),
]

GP_HOSTS = [
    ('默认财务数据线路', '120.76.152.87', 7709),
]

HF_HOSTS = [
    ('上海双线高级行情1', '121.37.183.82', 7709),
    ('深圳双线高级行情1', '110.41.174.169', 7709),
]

def return_last_value(retry_state):
    """return the result of the last call attempt"""
    return retry_state.outcome.result()
